---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.FabricArea
source: html/8fcacbf7-64da-2e97-b1ee-f744b2ee25f0.htm
---
# FabricArea Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.